{
  "common": {
    "loading": "Загрузка...",
    "error": "Произошла ошибка",
    "success": "Успешно",
    "copy": "Копировать",
    "data_error": "Не удалось получить параметры: убедитесь, что команда выполняется от имени администратора и система загружена в режиме UEFI"
  },
  "project": {
    "description": "Этот проект является частью исследования Black Hat USA 'Booting into Breaches: Hunting Windows SecureBoot's Remote Attack Surfaces'. Он поможет вам проверить, затронута ли ваша система 32 уязвимостью SecureBoot, обнаруженной Azure Yang и исправленной в 2024 году. Инструмент собирает анонимные данные для презентации на финальном докладе Black Hat.",
    "briefing_link": "https://www.blackhat.com/us-25/briefings/schedule/#booting-into-breaches-hunting-windows-secureboots-remote-attack-surfaces-45325",
    "briefing_text": "Посмотреть брифинг Black Hat",
    "vuln_list": {
      "button": "Показать затронутые уязвимости",
      "title": "Затронутые уязвимости SecureBoot",
      "table": {
        "cve": "CVE ID",
        "description": "Описание",
        "score": "Оценка CVSS"
      }
    },
    "research_details": "SecureBoot, разработанный для защиты от манипуляций на уровне прошивки, долгое время считался 'только локальной' поверхностью атаки. Это исследование опровергает это предположение, раскрывая системные недостатки, которые делают возможным удаленное использование SecureBoot, вплоть до Pre-Auth RCE на полностью исправленных системах. С 32 обнаруженным и исправленным CVE в реализации SecureBoot от Microsoft, мы показываем, как злоумышленники могут использовать компоненты загрузчика (сетевые стеки, реестры BCD, файловые системы) для обхода критических гарантий безопасности."
  },
  "platform": {
    "select": "Выберите вашу операционную систему:",
    "windows": "Windows",
    "linux": "Linux"
  },
  "instructions": {
    "windows": {
      "title": "Инструкции для Windows",
      "description": "Пожалуйста, выполните следующие команды PowerShell от имени администратора:",
      "paste": "Скопируйте вывод и вставьте ниже для анализа:"
    },
    "linux": {
      "title": "Инструкции для Linux",
      "description": "Пожалуйста, сохраните следующий скрипт как 'check_secureboot.py' и запустите его:",
      "paste": "Скопируйте вывод и вставьте ниже для анализа:"
    }
  },
  "analysis": {
    "placeholder": "Вставьте ваш вывод здесь...",
    "button": "Анализировать"
  },
  "results": {
    "title": "Результаты анализа",
    "secure_boot": {
      "enabled": "SecureBoot включен",
      "disabled": "SecureBoot отключен",
      "enabled_desc": "В вашей системе включен SecureBoot, что помогает защититься от вредоносного ПО на уровне загрузки.",
      "disabled_desc": "В вашей системе не включен SecureBoot. Это может сделать вашу систему уязвимой для атак на уровне загрузки."
    },
    "pca_cert": {
      "detected": "Обнаружен сертификат Windows PCA 2023",
      "not_detected": "Сертификат Windows PCA 2023 не обнаружен",
      "detected_desc": "Ваша база данных сертификатов загрузки актуальна.",
      "not_detected_desc": "KB5036210: Обновление БД позволит устройствам получать будущие обновления загрузчика, включенные в ежемесячные обновления. Это важно, так как существующий сертификат истечет, и переход на новый сертификат является первым шагом в подготовке устройств к работе с предстоящими обновлениями загрузчика, которые будут криптографически подписаны новым сертификатом.",
      "kb_link": "https://support.microsoft.com/help/5036210"
    },
    "vulnerability": {
      "not_vulnerable": "Не подвержен уязвимостям SecureBoot",
      "not_vulnerable_desc": "Ваш компьютер не подвержен 32 уязвимости, раскрытой в этом исследовании.",
      "vulnerable": "Подвержен уязвимостям SecureBoot",
      "vulnerable_desc": "Ваш компьютер подвержен 32 уязвимости, раскрытой в этом исследовании.",
      "vulnerable_guide": "Пожалуйста, обратитесь к KB5025885: Как управлять отзывами Windows Boot Manager для изменений Secure Boot, связанных с CVE-2023-24932. В этой статье описывается защита от этого обхода функции безопасности Secure Boot, как включить защиту и руководство по обновлению загрузочных носителей.",
      "kb_link": "https://support.microsoft.com/help/5025885",
      "bootmgr_bypass": "Предупреждение: Версия вашего Windows Boot Manager указывает на возможную уязвимость обхода функций безопасности",
      "bypass_status": {
        "vulnerable": "Предупреждение: Версия вашего Windows Boot Manager указывает на возможную уязвимость обхода функций безопасности",
        "protected": "SecureBoot вашего ПК полностью функционален и актуален"
      }
    }
  },
  "navigation": {
    "home": "Главная",
    "about": "О проекте",
    "settings": "Настройки"
  },
  "footer": {
    "contact": "Контакты"
  }
} 