{
  "common": {
    "loading": "Cargando...",
    "error": "Se produjo un error",
    "success": "Éxito",
    "copy": "Copiar",
    "data_error": "Error al obtener parámetros: Asegúrese de ejecutar el comando como administrador y verifique si su sistema está iniciado en modo UEFI"
  },
  "platform": {
    "select": "Selecciona tu sistema operativo:",
    "windows": "Windows",
    "linux": "Linux"
  },
  "instructions": {
    "windows": {
      "title": "Instrucciones para Windows",
      "description": "Por favor, ejecuta los siguientes comandos de PowerShell como Administrador:",
      "paste": "Copia la salida y pégala abajo para el análisis:"
    },
    "linux": {
      "title": "Instrucciones para Linux",
      "description": "Por favor, guarda el siguiente script como 'check_secureboot.py' y ejecútalo:",
      "paste": "Copia la salida y pégala abajo para el análisis:"
    }
  },
  "analysis": {
    "placeholder": "Pega tu salida aquí...",
    "button": "Analizar"
  },
  "results": {
    "title": "Resultados del Análisis",
    "secure_boot": {
      "enabled": "SecureBoot está habilitado",
      "disabled": "SecureBoot está deshabilitado",
      "enabled_desc": "Tu sistema tiene SecureBoot habilitado, lo que ayuda a proteger contra malware a nivel de arranque.",
      "disabled_desc": "Tu sistema no tiene SecureBoot habilitado. Esto puede dejar tu sistema vulnerable a ataques a nivel de arranque."
    },
    "pca_cert": {
      "detected": "Certificado Windows PCA 2023 detectado",
      "not_detected": "Certificado Windows PCA 2023 no detectado",
      "detected_desc": "Tu base de datos de certificados de arranque está actualizada.",
      "not_detected_desc": "KB5036210: La actualización de la DB permitirá que los dispositivos reciban futuras actualizaciones del cargador de arranque incluidas en las actualizaciones mensuales. Esto es importante porque el certificado existente caducará y la migración al nuevo certificado es el primer paso para preparar los dispositivos para trabajar con las próximas actualizaciones del cargador de arranque que serán firmadas criptográficamente usando el nuevo certificado.",
      "kb_link": "https://support.microsoft.com/help/5036210"
    },
    "vulnerability": {
      "not_vulnerable": "No es vulnerable a las brechas de SecureBoot",
      "not_vulnerable_desc": "Su PC no está afectada por las 31 vulnerabilidades reveladas en esta investigación.",
      "vulnerable": "Vulnerable a las brechas de SecureBoot",
      "vulnerable_desc": "Su PC es vulnerable a las 31 vulnerabilidades reveladas en esta investigación.",
      "vulnerable_guide": "Consulte KB5025885: Cómo gestionar las revocaciones del Administrador de arranque de Windows para los cambios de Secure Boot asociados con CVE-2023-24932. Este artículo describe la protección contra este bypass de la función de seguridad de Secure Boot, cómo habilitar las protecciones y la guía para actualizar los medios de arranque.",
      "kb_link": "https://support.microsoft.com/help/5025885",
      "bootmgr_bypass": "Advertencia: La versión de tu Administrador de Arranque de Windows indica una posible vulnerabilidad de bypass de características de seguridad",
      "bypass_status": {
        "vulnerable": "Advertencia: La versión de tu Administrador de Arranque de Windows indica una posible vulnerabilidad de bypass de características de seguridad",
        "protected": "Tu PC SecureBoot está completamente funcional y actualizado"
      }
    }
  },
  "navigation": {
    "home": "Inicio",
    "about": "Acerca de",
    "settings": "Configuración"
  },
  "footer": {
    "contact": "Contacto",
    "copyright": "© 2025 SecureBoot Check | Azure Yang con Kunlun Lab"
  },
  "project": {
    "description": "Este proyecto es parte de la investigación de Black Hat USA 'Booting into Breaches: Hunting Windows SecureBoot's Remote Attack Surfaces'. Te ayuda a verificar si tu sistema está afectado por las 31 vulnerabilidades de SecureBoot descubiertas por Azure Yang y parcheadas en 2024. La herramienta recopila datos anónimos para su presentación en la charla final de Black Hat.",
    "briefing_link": "https://www.blackhat.com/us-25/briefings/schedule/#booting-into-breaches-hunting-windows-secureboots-remote-attack-surfaces-45325",
    "briefing_text": "Ver el briefing de Black Hat",
    "vuln_list": {
      "button": "Mostrar Vulnerabilidades Afectadas",
      "title": "Vulnerabilidades de SecureBoot Afectadas",
      "table": {
        "cve": "ID de CVE",
        "description": "Descripción",
        "score": "Puntuación CVSS"
      }
    },
    "research_details": "SecureBoot, diseñado para proteger contra la manipulación a nivel de firmware, ha sido considerado durante mucho tiempo como una superficie de ataque 'solo local'. Esta investigación rompe esa suposición, exponiendo fallas sistémicas que permiten la explotación remota de SecureBoot, culminando en RCE pre-autenticación en sistemas completamente parcheados. Con 31 CVEs descubiertos y corregidos en la implementación de SecureBoot de Microsoft, revelamos cómo los atacantes pueden utilizar componentes del cargador de arranque (pilas de red, registros BCD, sistemas de archivos) para eludir las garantías críticas de seguridad."
  }
} 